{
    "labels": [
        "Apel",
        "Pisang",
        "Gram hitam",
        "Buncis",
        "Kelapa",
        "Kopi",
        "Kapas",
        "Anggur",
        "Wortel",
        "Kacang Merah",
        "Lentil",
        "Jagung",
        "Manga",
        "Kacang Ngengat",
        "Kacang Hijau",
        "Melon",
        "Jeruk",
        "Pepaya",
        "Kacang Gude",
        "Delima",
        "Padi",
        "Semangka"
    ],
    "imgs": [
        "apple.png",
        "banana.png",
        "blackgram.png",
        "salad.png",
        "coconut.png",
        "coffee.png",
        "cotton.png",
        "grapes.png",
        "carrot.png",
        "kidneybeans.png",
        "lentils.png",
        "maize.png",
        "mango.png",
        "mothbeans.png",
        "mungbean.png",
        "muskmelon.png",
        "orange.png",
        "papaya.png",
        "pigeonpeas.png",
        "pomegranate.png",
        "rice.png",
        "watermelon.png"
    ],
    "desc": [
        "Tanah tempat pohon apel tumbuh harus dikeringkan dengan baik; pupuk dapat digunakan jika hasil panen tidak cukup tinggi. Puncak bukit yang landai atau sisi bukit yang landai lebih disukai karena menyediakan “drainase udara”, yang memungkinkan udara yang lebih dingin dan lebih berat mengalir ke lembah di bawahnya selama malam musim semi yang membekukan, ketika bunga atau buah muda akan hancur karena terkena dingin.",
        "Pisang, pada dasarnya merupakan tanaman tropis, tumbuh dengan baik pada kisaran suhu 15ºC – 35ºC dengan kelembaban relatif 75-85%. Ini lebih suka dataran rendah lembab tropis dan tumbuh dari permukaan laut hingga ketinggian 2000m. di atas m.s.l. Di India tanaman ini dibudidayakan dalam iklim mulai dari tropis lembab hingga subtropis ringan kering melalui pemilihan varietas yang sesuai.",
        "Gram hitam dapat ditanam pada berbagai jenis tanah mulai dari tanah berpasir hingga tanah kapas yang berat. Tanah yang paling ideal adalah lempung berdrainase baik dengan pH 6,5 hingga 7,8. Gram hitam tidak dapat tumbuh di tanah alkalin dan salin.",
        "Sebagian buncis salad sayuran cepat tumbuh dan siap panen hanya 4 hingga 6 minggu sejak penyemaian. Mereka dapat ditanam di tempat tidur taman atau wadah, dengan sebagian besar tumbuh subur di suhu musim semi dan musim gugur yang lebih dingin, meskipun ada juga banyak sayuran tahan panas untuk panen musim panas.",
        "Pohon kelapa ditemukan tumbuh di bawah kondisi iklim dan tanah yang bervariasi. Ini pada dasarnya adalah tanaman tropis, tumbuh paling banyak di antara garis lintang 20° N dan 20° S. Suhu ideal untuk pertumbuhan dan hasil kelapa adalah 27 ± 5° C dan kelembaban > 60 persen. Pohon kelapa tumbuh dengan baik hingga ketinggian 600 m di atas MSL.",
        "Faktor iklim yang paling penting untuk pertumbuhan kopi adalah suhu dan curah hujan. Tidak ada varietas yang tahan suhu di sekitar 32 °F (0 °C). Suhu antara 73 dan 82 °F (23 dan 28 °C) adalah yang paling disukai.",
        "Pengupas kapas digunakan di daerah yang terlalu berangin untuk menanam varietas pemetik kapas, dan biasanya setelah aplikasi defoliant kimiawi atau defoliasi alami yang terjadi setelah pembekuan. Kapas merupakan tanaman tahunan di daerah tropis, dan tanpa defoliasi atau pembekuan tanaman akan terus tumbuh.",
        "Anggur adalah tanaman tahunan yang diairi secara ketat dan diairi secara teratur. Untuk irigasi banjir, 5-7 hari selama musim panas 8-10 hari selama musim dingin dan 15-20 hari selama musim hujan. Interval dipertahankan sedangkan untuk irigasi tetes, 40-50 L; 30-40, 20-30 L air per hari per pokok anggur, air diterapkan.",
        "Untuk mendapatkan hasil optimal wortel harus dibudidayakan di dataran tinggi dengan ketinggian minimal 1000 mdpl dengan temperatur udara optimal 15 -21 derajat Celsius. Karena alasan tersebut kebun wortel biasa ditemukan di daerah Batu, Nongkojajar, Dieng, dan Priangan.",
        "Kacang merah cukup mudah untuk tumbuh, tetapi Anda perlu memastikan bahwa akarnya tidak tergenang air atau rusak di titik mana pun selama musimnya. Seperti banyak varietas kacang lainnya, kacang merah dapat ditanam sebagai semak atau tanaman merambat, jadi Anda harus memilih jenis yang paling sesuai dengan ruang yang Anda miliki.",
        "Lentil dapat tumbuh di berbagai jenis tanah, dari pasir hingga lempung liat, tumbuh paling baik di tanah lempung berpasir dalam dengan kesuburan sedang. PH tanah sekitar 7 akan menjadi yang terbaik. Lentil tidak mentolerir kondisi banjir atau genangan air.",
        "Pada umumnya tanaman jagung dapat tumbuh di berbagai kondisi lingkungan. Ada beberapa syarat agar Tanaman jagung tumbuh maksimal. Curah hujan ideal adalah 85-200 mm/bulan dan harus merata. Suhu optimimum yang baik adalah 21-34 C.",
        "Mangga sekarang dibudidayakan di sebagian besar iklim tropis dan subtropis yang lebih hangat dan bebas embun beku. Tanaman ini dibudidayakan secara luas di Asia Selatan, Asia Tenggara, Afrika Timur dan Barat, Amerika tropis dan subtropis, dan Caribean.",
        "Kacang ini adalah tanaman hari pendek. Kacang ini adalah satu kacang-kacangan yang paling tahan kekeringan di India. Tumbuh pada ketinggian hingga 1300 m dpl, memiliki kisaran pH yang luas (3,5–10) dan dapat mentolerir sedikit salinitas.",
        "Kacang hijau adalah tanaman yang berdurasi pendek yang ditanam di India utara. Karena durasinya yang singkat, tanaman ini bisa cocok ditanam diberbagai banyak sistem tanam. Tanaman ini dibudidayakan di Asia Timur dan Tenggara dan benua India. Tanaman Ini dianggap yang paling keras dari semua tanaman yang membutuhkan iklim panas untuk perkecambahan dan pertumbuhan.",
        "Tumbuhan semusim, merambat tetapi menjalar, tidak memanjat. Daun berbentuk menjari dengan lekuk moderat sehingga seperti lingkaran bersudut. Batangnya biasanya tidak berkayu.",
        "Pohon jeruk tumbuh dengan sangat mudah, tergantung pada sumber serbuk sarinya, tanaman yang ditanam dari biji jeruk nipis Persia dapat menghasilkan buah yang mirip dengan jeruk bali. Dengan demikian, semua budidaya jeruk komersial menggunakan pohon yang dihasilkan dengan mencangkok kultivar buah yang diinginkan ke batang bawah yang dipilih untuk tahan penyakit.",
        "Tanaman pepaya tumbuh dalam tiga jenis kelamin: jantan, betina, dan hermafrodit. Laki-laki hanya menghasilkan serbuk sari, tidak pernah berbuah. Betina menghasilkan buah kecil yang tidak bisa dimakan kecuali diserbuki. Hermafrodit dapat melakukan penyerbukan sendiri karena bunganya mengandung benang sari jantan dan ovarium betina. Hampir semua kebun pepaya komersial hanya mengandung hermafrodit.",
        "Kacang gude dapat menjadi varietas abadi, di mana tanaman dapat bertahan tiga hingga lima tahun (walaupun hasil biji turun drastis setelah dua tahun pertama), atau varietas tahunan yang lebih cocok untuk produksi benih.",
        "Delima ditanam untuk tanaman buahnya, sebagai pohon hias dan semak di taman dan kebun. Spesimen dewasa dapat mengembangkan beberapa batang kayu bengkok pahatan dan bentuk keseluruhan yang khas. Delima toleran kekeringan, dan dapat ditanam di daerah kering dengan iklim curah hujan musim dingin Mediterania atau di iklim curah hujan musim panas.",
        "Metode tradisional untuk bercocok tanam padi adalah membanjiri sawah saat, atau setelah, menanam bibit muda. Metode sederhana ini membutuhkan perencanaan irigasi yang baik tetapi mengurangi pertumbuhan tanaman gulma dan hama yang kurang kuat yang tidak memiliki kondisi pertumbuhan terendam, dan mencegah hama.",
        "Semangka adalah tanaman yang tumbuh dari iklim tropis hingga sedang, membutuhkan suhu lebih tinggi dari sekitar 25 °C (77 °F) untuk tumbuh subur. Pada skala taman, benih biasanya ditanam dalam pot di bawah penutup dan dipindahkan ke lempung berpasir yang dikeringkan dengan baik dengan pH antara 5,5 dan 7 dan tingkat nitrogen sedang."
    ],
    "img_path" : "crop_images/"
}